In [1]:
! pip install ipython-sql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (0.5.0)
Requirement already satisfied: ipython in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython-sql) (7.21.0)
Requirement already satisfied: ipython-genutils in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: sqlparse in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: six in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\bilene.fas\appdata\roaming\python\python39\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: traitlets>=4.2 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pygments in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (2.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (3.0.5)
Requirement already satisfied: colorama in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: pickleshare in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.18.0)
Requirement already satisfied: backcall in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: setuptools>=18.5 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from ipython->ipython-sql) (60.10.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\program files\arcgis\pro\bin\python\envs\arcgispro-py3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///C:\Users\bilene\book.db

In [10]:
output = %sql SELECT pop FROM indicators0

 * sqlite:///C:\Users\bilene\book.db
Done.

In [13]:
import pandas as pd
pd.DataFrame(output,columns=['pop'])

       pop
0  1386.40
1    66.87
2    66.06
3  1338.66
4   325.15

In [18]:
%%sql 
output2 <<
SELECT pop 
FROM indicators0

 * sqlite:///C:\Users\bilene\book.db
Done.
Returning data to local variable output2

In [19]:
output2

[(1386.4,), (66.87,), (66.06,), (1338.66,), (325.15,)]

In [21]:
%%sql
SELECT name FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('Mary',), ('John',), ('Mary',), ('John',), ('Mary',)]

In [25]:
%%sql
SELECT year, name, sex FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1880, 'Mary', 'Female'),
 (1880, 'John', 'Male'),
 (1881, 'Mary', 'Female'),
 (1881, 'John', 'Male'),
 (1882, 'Mary', 'Female')]

In [26]:
%%sql
SELECT year AS Year, name, sex FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1880, 'Mary', 'Female'),
 (1880, 'John', 'Male'),
 (1881, 'Mary', 'Female'),
 (1881, 'John', 'Male'),
 (1882, 'Mary', 'Female')]

In [29]:
%%sql
SELECT * FROM topnames
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1880, 'Female', 'Mary', 7065),
 (1880, 'Male', 'John', 9655),
 (1881, 'Female', 'Mary', 6919),
 (1881, 'Male', 'John', 8769),
 (1882, 'Female', 'Mary', 8148)]

In [36]:
%%sql
-- Here is a one line comment
/* Here is a multi line comment
 Another one */
    
-- The following returns all tables that exist
-- in the database
SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///C:\Users\bilene\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [9]:
%%sql
-- Row filtering
SELECT * FROM indicators 
WHERE year>=2000
LIMIT 10

 * sqlite:///C:\Users\bilene\book.db
Done.

[(2000, 'ABW', 0.09, 1.87, 73.8, 0.02, 793.83, 173.0),
 (2000, 'AFG', 20.78, None, 55.5, 0.0, 531.88, 149.26),
 (2000, 'AGO', 16.4, 9.13, 47.1, 0.03, 2067.69, 9434.58),
 (2000, 'ALB', 3.09, 3.48, 74.0, 0.03, 1093.52, 256.22),
 (2000, 'AND', 0.07, 1.43, None, 0.02, None, None),
 (2000, 'ARE', 3.13, 104.34, 74.2, 1.43, 25426.7, 43116.0),
 (2000, 'ARG', 36.87, 284.2, 73.8, 6.49, 25134.3, 26324.4),
 (2000, 'ARM', 3.07, 1.91, 71.4, 0.02, 884.66, 301.29),
 (2000, 'ASM', 0.06, None, None, 0.0, 66.96, 3.86),
 (2000, 'ATG', 0.08, 0.83, 73.5, 0.02, 864.95, 330.53)]

In [13]:
%%sql
SELECT * FROM indicators 
WHERE pop > 1000 AND life > 60
LIMIT 10

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1982, 'CHN', 1008.63, 205.09, 67.6, 0.0, 18915.5, 21863.1),
 (1983, 'CHN', 1023.31, 230.69, 67.9, 0.0, 21306.4, 22093.4),
 (1984, 'CHN', 1036.82, 259.95, 68.2, 0.0, 25953.4, 24821.7),
 (1985, 'CHN', 1051.04, 309.49, 68.5, 0.0, 42480.2, 27328.4),
 (1986, 'CHN', 1066.79, 300.76, 68.7, 0.0, 43275.4, 31367.3),
 (1987, 'CHN', 1084.04, 272.97, 68.8, 0.0, 43222.7, 39462.0),
 (1988, 'CHN', 1101.63, 312.35, 69.0, 0.0, 55352.1, 47660.0),
 (1989, 'CHN', 1118.65, 347.77, 69.2, 0.01, 59140.9, 52907.9),
 (1990, 'CHN', 1135.18, 360.86, 69.3, 0.02, 53809.6, 62755.9),
 (1991, 'CHN', 1150.78, 383.37, 69.4, 0.05, 63876.8, 71962.5)]

In [14]:
%%sql
SELECT * FROM countries
LIMIT 10

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 ('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('ARM', 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 ('ASM', 'American Samoa', 'East Asia & Pacific', 'Upper middle income', 200.0),
 ('ATG', 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0)]

In [15]:
%%sql
-- Return only high income countries
SELECT * FROM countries
WHERE income = 'High income'
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 ('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 ('ATG', 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0),
 ('AUS', 'Australia', 'East Asia & Pacific', 'High income', 7692020.0)]

In [18]:
%%sql
-- Return rows where baby name is not John
-- In pandas: name != 'John'
SELECT name, sex FROM topnames
WHERE name <> 'John'
-- keep in mind this still works: WHERE name != 'John'
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('Mary', 'Female'),
 ('Mary', 'Female'),
 ('Mary', 'Female'),
 ('Mary', 'Female'),
 ('Mary', 'Female')]

In [19]:
%%sql
SELECT * FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [27]:
%%sql
-- Return countries with land > 10000 and the country must be either
-- High income, or Upper middle income

SELECT * FROM countries
WHERE (land>10000) AND (income='High income' OR income='Upper middle income')
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('ARM', 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 ('AUS', 'Australia', 'East Asia & Pacific', 'High income', 7692020.0)]

In [31]:
%%sql
-- Filter intervals
SELECT * FROM indicators
WHERE life BETWEEN 65 AND 75
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'ARG', 20.48, None, 65.0, 0.0, 1227.3, 1079.1),
 (1960, 'ARM', 1.87, None, 66.0, 0.0, None, None),
 (1960, 'AUS', 10.28, 18.58, 70.8, 0.0, 2524.06, 2022.9),
 (1960, 'AUT', 7.05, 6.59, 68.6, 0.0, 1408.8, 1118.9)]

In [33]:
%%sql
-- Return where year is 2017 and countries with code
-- CHN, IND, FRA, USA
SELECT * FROM indicators
WHERE year = 2017 AND code IN ('CHN','IND','FRA','USA')
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[(2017, 'CHN', 1386.4, 12143.5, 76.4, 1469.88, 1832130.0, 2280090.0),
 (2017, 'FRA', 66.87, 2586.29, 82.5, 69.02, 625663.0, 535120.0),
 (2017, 'IND', 1338.66, 2652.55, 68.8, 1168.9, 442983.0, 296212.0),
 (2017, 'USA', 325.15, 19485.4, 78.5, 391.6, 2342670.0, 1545610.0)]

In [36]:
%%sql
-- Wildcard, %
-- Return countries whose names start with "United"
SELECT * FROM countries
WHERE country LIKE 'United%'
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 ('GBR', 'United Kingdom', 'Europe & Central Asia', 'High income', 241930.0),
 ('USA', 'United States', 'North America', 'High income', 9147420.0)]

In [40]:
%%sql
-- Wildcard
-- Return back countries whose names start with A and end with a
SELECT * FROM countries
WHERE country LIKE 'A%a'
LIMIT 10

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('ARM', 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 ('ASM', 'American Samoa', 'East Asia & Pacific', 'Upper middle income', 200.0),
 ('ATG', 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0),
 ('AUS', 'Australia', 'East Asia & Pacific', 'High income', 7692020.0),
 ('AUT', 'Austria', 'Europe & Central Asia', 'High income', 82523.0)]

In [45]:
%%sql
-- Return back the countries whose code ends with "ZA"
-- forces the output "code" to have three characters
SELECT * FROM countries
WHERE code LIKE '_ZA'

 * sqlite:///C:\Users\bilene\book.db
Done.

[('DZA', 'Algeria', 'Middle East & North Africa', 'Upper middle income', 2381740.0),
 ('TZA', 'Tanzania', 'Sub-Saharan Africa', 'Low income', 885800.0)]

In [47]:
%%sql
-- Return back the countries whose code ends with "A"
-- force the output "code" to have three characters
SELECT * FROM countries
WHERE code LIKE "__A"
LIMIT 10

 * sqlite:///C:\Users\bilene\book.db
Done.

[('BFA', 'Burkina Faso', 'Sub-Saharan Africa', 'Low income', 273600.0),
 ('BRA', 'Brazil', 'Latin America & Caribbean', 'Upper middle income', 8358140.0),
 ('BWA', 'Botswana', 'Sub-Saharan Africa', 'Upper middle income', 566730.0),
 ('DMA', 'Dominica', 'Latin America & Caribbean', 'Upper middle income', 750.0),
 ('DZA', 'Algeria', 'Middle East & North Africa', 'Upper middle income', 2381740.0),
 ('FRA', 'France', 'Europe & Central Asia', 'High income', 547557.0),
 ('GHA', 'Ghana', 'Sub-Saharan Africa', 'Lower middle income', 227540.0),
 ('ITA', 'Italy', 'Europe & Central Asia', 'High income', 294140.0),
 ('KNA', 'St. Kitts and Nevis', 'Latin America & Caribbean', 'High income', 260.0),
 ('LCA', 'St. Lucia', 'Latin America & Caribbean', 'Upper middle income', 610.0)]

In [51]:
%%sql
-- return back non-missing values based on a column
SELECT * FROM countries
WHERE land IS NOT NULL
LIMIT 50

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0),
 ('ARE', 'United Arab Emirates', 'Middle East & North Africa', 'High income', 71020.0),
 ('ARG', 'Argentina', 'Latin America & Caribbean', 'Upper middle income', 2736690.0),
 ('ARM', 'Armenia', 'Europe & Central Asia', 'Upper middle income', 28470.0),
 ('ASM', 'American Samoa', 'East Asia & Pacific', 'Upper middle income', 200.0),
 ('ATG', 'Antigua and Barbuda', 'Latin America & Caribbean', 'High income', 440.0),
 ('AUS', 'Australia', 'East Asia & Pacific', 'High income', 7692020.0),
 ('AUT', 'Austria', 'Europe & Central Asia', 'High income', 82523.0),
 ('AZE', 'Azerbaijan', 'Europe & Central Asia', 'Upper middle income', 82670.0),
 ('BDI', 'Burundi', 'Sub-Saharan Africa', 'Low income', 25680.0),
 ('BEL', 'Belgium', 'Europe & Central Asia', 'High income', 30280.0),
 ('BEN', 'Benin', 'Sub-Saharan Africa', 'Low income', 112760.0),
 ('BFA', 'Burkina Faso', 'Sub-Saharan Africa', 'Low income', 273600.0),
 ('BGD', 'Bangladesh', 'South Asia', 'Lower middle income', 130170.0),
 ('BGR', 'Bulgaria', 'Europe & Central Asia', 'Upper middle income', 108560.0),
 ('BHR', 'Bahrain', 'Middle East & North Africa', 'High income', 778.0),
 ('BHS', 'Bahamas, The', 'Latin America & Caribbean', 'High income', 10010.0),
 ('BIH', 'Bosnia and Herzegovina', 'Europe & Central Asia', 'Upper middle income', 51200.0),
 ('BLR', 'Belarus', 'Europe & Central Asia', 'Upper middle income', 202988.0),
 ('BLZ', 'Belize', 'Latin America & Caribbean', 'Upper middle income', 22810.0),
 ('BMU', 'Bermuda', 'North America', 'High income', 54.0),
 ('BOL', 'Bolivia', 'Latin America & Caribbean', 'Lower middle income', 1083300.0),
 ('BRA', 'Brazil', 'Latin America & Caribbean', 'Upper middle income', 8358140.0),
 ('BRB', 'Barbados', 'Latin America & Caribbean', 'High income', 430.0),
 ('BRN', 'Brunei Darussalam', 'East Asia & Pacific', 'High income', 5270.0),
 ('BTN', 'Bhutan', 'South Asia', 'Lower middle income', 38144.0),
 ('BWA', 'Botswana', 'Sub-Saharan Africa', 'Upper middle income', 566730.0),
 ('CAF', 'Central African Republic', 'Sub-Saharan Africa', 'Low income', 622980.0),
 ('CAN', 'Canada', 'North America', 'High income', 9093510.0),
 ('CHE', 'Switzerland', 'Europe & Central Asia', 'High income', 39516.0),
 ('CHI', 'Channel Islands', 'Europe & Central Asia', 'High income', 198.0),
 ('CHL', 'Chile', 'Latin America & Caribbean', 'High income', 743532.0),
 ('CHN', 'China', 'East Asia & Pacific', 'Upper middle income', 9388210.0),
 ('CIV', 'Cote dIvoire', 'Sub-Saharan Africa', 'Lower middle income', 318000.0),
 ('CMR', 'Cameroon', 'Sub-Saharan Africa', 'Lower middle income', 472710.0),
 ('COD', 'Congo, Dem. Rep.', 'Sub-Saharan Africa', 'Low income', 2267050.0),
 ('COG', 'Congo, Rep.', 'Sub-Saharan Africa', 'Lower middle income', 341500.0),
 ('COL', 'Colombia', 'Latin America & Caribbean', 'Upper middle income', 1109500.0),
 ('COM', 'Comoros', 'Sub-Saharan Africa', 'Lower middle income', 1861.0),
 ('CPV', 'Cabo Verde', 'Sub-Saharan Africa', 'Lower middle income', 4030.0),
 ('CRI', 'Costa Rica', 'Latin America & Caribbean', 'Upper middle income', 51060.0),
 ('CUB', 'Cuba', 'Latin America & Caribbean', 'Upper middle income', 104020.0),
 ('CYM', 'Cayman Islands', 'Latin America & Caribbean', 'High income', 240.0),
 ('CYP', 'Cyprus', 'Europe & Central Asia', 'High income', 9240.0),
 ('CZE', 'Czech Republic', 'Europe & Central Asia', 'High income', 77220.0),
 ('DEU', 'Germany', 'Europe & Central Asia', 'High income', 349360.0)]

In [52]:
%%sql
-- return back missing values based on a column
SELECT * FROM countries
WHERE land IS NULL
LIMIT 50

 * sqlite:///C:\Users\bilene\book.db
Done.

[('CUW', 'Curacao', 'Latin America & Caribbean', 'High income', None),
 ('MAF', 'St. Martin (French part)', 'Latin America & Caribbean', 'High income', None),
 ('MCO', 'Monaco', 'Europe & Central Asia', 'High income', None),
 ('SDN', 'Sudan', 'Sub-Saharan Africa', 'Lower middle income', None),
 ('SSD', 'South Sudan', 'Sub-Saharan Africa', 'Low income', None),
 ('SXM', 'Sint Maarten (Dutch part)', 'Latin America & Caribbean', 'High income', None),
 ('XKX', 'Kosovo', 'Europe & Central Asia', 'Upper middle income', None)]

In [59]:
%%sql
-- Create a new column called "newpop" that equals pop*1.15 in
-- the table indicators0
-- round the fractions
SELECT *, ROUND(pop*1.15,2) AS newpop FROM indicators0
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88, 1594.36),
 ('FRA', 66.87, 2586.29, 82.5, 69.02, 76.9),
 ('GBR', 66.06, 2637.87, 81.2, 79.1, 75.97),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9, 1539.46),
 ('USA', 325.15, 19485.4, 78.5, 391.6, 373.92)]

In [62]:
%%sql
-- create an indicator variable (dummy variable, binary variable)
-- that equals 1 if life > 75, 0 otherwise.
SELECT *, life>75 AS longlife FROM indicators0
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88, 1),
 ('FRA', 66.87, 2586.29, 82.5, 69.02, 1),
 ('GBR', 66.06, 2637.87, 81.2, 79.1, 1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9, 0),
 ('USA', 325.15, 19485.4, 78.5, 391.6, 1)]

In [64]:
'word1' + ' ' + 'word2'

'word1 word2'

In [67]:
%%sql
-- create a new column called country2 that has the following
-- format 'Countryname (3digitcode)'
-- || in sql is equivalent to + in python
SELECT *, country || ' (' || code || ')' AS country2 FROM countries
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0, 'Aruba (ABW)'),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0, 'Afghanistan (AFG)'),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0, 'Angola (AGO)'),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0, 'Albania (ALB)'),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0, 'Andorra (AND)')]

In [68]:
%%sql
-- COUNT function counts all values
-- countries table has 217 observations
SELECT COUNT(*) AS total FROM countries

 * sqlite:///C:\Users\bilene\book.db
Done.

[(217,)]

In [74]:
%%sql
-- COUNT function counts all values
-- countries table has 7 missing rows for 'land'
SELECT COUNT(*) AS missing_land FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\book.db
Done.

[(7,)]

In [84]:
%%sql
-- put the two numbers side by side
-- an example of a nested sql queries
SELECT COUNT(*) AS total,
(SELECT COUNT(*) FROM countries
WHERE land is NULL) AS missing_land
FROM countries

 * sqlite:///C:\Users\bilene\book.db
Done.

[(217, 7)]